Revit 2024 API
StructuralAsset.Lightweight Property
 Flag indicating whether the asset describes a material that is light-weight or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool Lightweight { get; set; }
Visual Basic
Public Property Lightweight As Boolean
	Get
	Set
Visual C++
public:
property bool Lightweight {
	bool get ();
	void set (bool value);
}
See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace